In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('/content/sample_data/salaries.csv')
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

Classifiers work on numeric values, so change all the columns to numbers.

In [22]:
# X is the independent variables
X_temp = df.drop(['salary_more_then_100k'],axis="columns")
X_temp.head()

  company                  job     degree
0  google      sales executive  bachelors
1  google      sales executive    masters
2  google     business manager  bachelors
3  google     business manager    masters
4  google  computer programmer  bachelors

In [23]:
from sklearn.preprocessing import LabelEncoder
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [24]:
X_temp['company_new'] = le_company.fit_transform(X_temp.company)
X_temp['degree_new'] = le_degree.fit_transform(X_temp.degree)
X_temp['job_new'] = le_job.fit_transform(X_temp.job)
X_temp

       company                  job  ... degree_new  job_new
0       google      sales executive  ...          0        2
1       google      sales executive  ...          1        2
2       google     business manager  ...          0        0
3       google     business manager  ...          1        0
4       google  computer programmer  ...          0        1
5       google  computer programmer  ...          1        1
6   abc pharma      sales executive  ...          1        2
7   abc pharma  computer programmer  ...          0        1
8   abc pharma     business manager  ...          0        0
9   abc pharma     business manager  ...          1        0
10    facebook      sales executive  ...          0        2
11    facebook      sales executive  ...          1        2
12    facebook     business manager  ...          0        0
13    facebook     business manager  ...          1        0
14    facebook  computer programmer  ...          0        1
15    facebook  computer programmer  ...          1        1

[16 rows x 6 columns]

In [25]:
X = X_temp.drop(['company','job','degree'],axis="columns")
X

    company_new  degree_new  job_new
0             2           0        2
1             2           1        2
2             2           0        0
3             2           1        0
4             2           0        1
5             2           1        1
6             0           1        2
7             0           0        1
8             0           0        0
9             0           1        0
10            1           0        2
11            1           1        2
12            1           0        0
13            1           1        0
14            1           0        1
15            1           1        1

In [26]:
Y = df['salary_more_then_100k']
Y.head()

0    0
1    0
2    1
3    1
4    0
Name: salary_more_then_100k, dtype: int64

In [41]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,Y,test_size=0.2)

In [35]:
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [42]:
model.fit(X_train,y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [43]:
model.score(X_test,y_test)

0.75

Now we are going to do another exercise.

In [44]:
df_titanic = pd.read_csv('/content/sample_data/titanic.csv')
df_titanic

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [45]:
Y = df_titanic['Survived']
Y

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [51]:
X_temp_titanic = df_titanic[['Pclass','Sex','Age','Fare']]
X_temp_titanic

     Pclass     Sex   Age     Fare
0         3    male  22.0   7.2500
1         1  female  38.0  71.2833
2         3  female  26.0   7.9250
3         1  female  35.0  53.1000
4         3    male  35.0   8.0500
..      ...     ...   ...      ...
886       2    male  27.0  13.0000
887       1  female  19.0  30.0000
888       3  female   NaN  23.4500
889       1    male  26.0  30.0000
890       3    male  32.0   7.7500

[891 rows x 4 columns]

In [48]:
from sklearn.preprocessing import LabelEncoder
le_sex = LabelEncoder()

In [53]:
X_temp_titanic['num_sex'] = le_sex.fit_transform(X_temp_titanic['Sex'])
X_temp_titanic

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

     Pclass     Sex   Age     Fare  num_sex
0         3    male  22.0   7.2500        1
1         1  female  38.0  71.2833        0
2         3  female  26.0   7.9250        0
3         1  female  35.0  53.1000        0
4         3    male  35.0   8.0500        1
..      ...     ...   ...      ...      ...
886       2    male  27.0  13.0000        1
887       1  female  19.0  30.0000        0
888       3  female   NaN  23.4500        0
889       1    male  26.0  30.0000        1
890       3    male  32.0   7.7500        1

[891 rows x 5 columns]

In [54]:
X = X_temp_titanic.drop('Sex',axis="columns")
X

     Pclass   Age     Fare  num_sex
0         3  22.0   7.2500        1
1         1  38.0  71.2833        0
2         3  26.0   7.9250        0
3         1  35.0  53.1000        0
4         3  35.0   8.0500        1
..      ...   ...      ...      ...
886       2  27.0  13.0000        1
887       1  19.0  30.0000        0
888       3   NaN  23.4500        0
889       1  26.0  30.0000        1
890       3  32.0   7.7500        1

[891 rows x 4 columns]

In [62]:
import math

Age_for_nan = math.floor(X['Age'].median())
Age_for_nan

28

In [63]:
X['Age'] = X['Age'].fillna(Age_for_nan)
X

     Pclass   Age     Fare  num_sex
0         3  22.0   7.2500        1
1         1  38.0  71.2833        0
2         3  26.0   7.9250        0
3         1  35.0  53.1000        0
4         3  35.0   8.0500        1
..      ...   ...      ...      ...
886       2  27.0  13.0000        1
887       1  19.0  30.0000        0
888       3  28.0  23.4500        0
889       1  26.0  30.0000        1
890       3  32.0   7.7500        1

[891 rows x 4 columns]

In [64]:
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [65]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,Y,test_size=0.2)

In [66]:
model.fit(X,Y)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [67]:
model.score(X_test,y_test)

0.9776536312849162